Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.PrependArc Method
 Prepends an arc using three points. The last point is taken as the start point of the first element of the polycurve.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder PrependArc(
	Point startPoint,
	Point middlePoint
)
Public Function PrependArc (
	startPoint As Point,
	middlePoint As Point
) As PolycurveGeometryBuilder
Parameters
startPoint
Type: Tekla.Structures.Geometry3d.Point
Arc start point
middlePoint
Type: Tekla.Structures.Geometry3d.Point
Arc middle point
Return Value
Type: PolycurveGeometryBuilder
The builder itself
Remarks
 This function requires that there is at least one curve in the polycurve
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace